# frontend_service/config.py

# ==========================================================
# SERVER SETTINGS
# ==========================================================
FRONTEND_HOST = "0.0.0.0"
FRONTEND_PORT = 5000

# ==========================================================
# SERVICE URLs
# ==========================================================
DETECTOR_SERVICE_URL = "http://localhost:5001"
VERIFICATION_SERVICE_URL = "http://localhost:5002"

DETECTOR_TIMEOUT = 10  # Увеличенный таймаут для детектора

# ==========================================================
# REPORT SETTINGS
# ==========================================================
REPORTS_DIR = None #замените на реальную директорию для отчётов, н-р: r"C:\Users\User\Diplom\reports"  